Tekla Open API Reference for Tekla Structures 2025
ClipPlaneCollection.SyncRoot Property
 Gets an object that can be used to synchronize access to the ICollection.
 Namespace: Tekla.Structures.Model.UI
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object SyncRoot { get; }
Public ReadOnly Property SyncRoot As Object
	Get
Property Value
Type: Object
Implements
ICollection.SyncRoot
See Also
Reference
ClipPlaneCollection Class
Tekla.Structures.Model.UI Namespace